Labbbbbbbbb/EC2025/Sample_Projects/stm32/EC_tesr_F4/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Blue_Laser_PWM_Pin GPIO_PIN_0
#define Blue_Laser_PWM_GPIO_Port GPIOA
#define HWT_Tx_Pin GPIO_PIN_2
#define HWT_Tx_GPIO_Port GPIOA
#define HWT_Rx_Pin GPIO_PIN_3
#define HWT_Rx_GPIO_Port GPIOA
#define oled_RES_Pin GPIO_PIN_4
#define oled_RES_GPIO_Port GPIOA
#define oled_D0_Pin GPIO_PIN_5
#define oled_D0_GPIO_Port GPIOA
#define oled_DC_Pin GPIO_PIN_6
#define oled_DC_GPIO_Port GPIOA
#define oled_D1_Pin GPIO_PIN_7
#define oled_D1_GPIO_Port GPIOA
#define oled_CS_Pin GPIO_PIN_4
#define oled_CS_GPIO_Port GPIOC
#define Buzzer_Pin GPIO_PIN_5
#define Buzzer_GPIO_Port GPIOC
#define FeeTech_Tx_Pin GPIO_PIN_9
#define FeeTech_Tx_GPIO_Port GPIOA
#define FeeTech_Rx_Pin GPIO_PIN_10
#define FeeTech_Rx_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
